In [ ]:
- Python
    -variables    storing data
    -data types - int float string -string list dictionary sets range
    - functions - create reusable code, lots of line of code in one place
    - classes - help us containerise code, box things up, 

- Libraries
    -numPy - **arrays** we can create matrices, numerical calculation
    - pandas - **DataFames** store data like spread sheets, excel sheets, we can manipulate those tables.

- Machine Learning
        - data - clean data, analyse data, play with data
        - feed to the machine
        - show the machine what is right, what is wrong (learns, creates its own patterns)
        - then you ask questions, and get answers

#### dictionaries???

- we will try to create a dictionary
- data types with keys and values

In [9]:
# create a small dictionary
# names of 4 students, and their marks

# key : value

students_grades = {
    'name':['Idrees','Amri','Ali','Abu'],
    'maths':[90,85,97,89],
    'english':[89,86,77,88],
    'science':[78,89,98,91]}

print(students_grades)

{'name': ['Idrees', 'Amri', 'Ali', 'Abu'], 'maths': [90, 85, 97, 89], 'english': [89, 86, 77, 88], 'science': [78, 89, 98, 91]}

In [ ]:
students_grades["name"]

students_grades["name"][2]

In [ ]:
pip install pandas

In [27]:
import pandas as pd

df = pd.DataFrame(students_grades)

df

     name  maths  english  science
0  Idrees     90       89       78
1    Amri     85       86       89
2     Ali     97       77       98
3     Abu     89       88       91

In [26]:
type(df)

# numpy.ndarray

pandas.core.frame.DataFrame

In [25]:
df.head(4) # top part of a df plus num of rows u put in column
            # 5 is a default argument
df.tail() # below part of a df

     name  maths  english  science
0  Idrees     90       89       78
1    Amri     85       86       89
2     Ali     97       77       98
3     Abu     89       88       91

In [22]:
# we can access certain columns in dataframes too

df.max()

name       Idrees
maths          97
english        89
science        98
dtype: object

In [23]:
import numpy as np
arrayyy = np.array([])
type(arrayyy)

numpy.ndarray

In [ ]:
# series

marks_series = pd.Series([])
type(marks_series)

pandas.core.series.Series

In [29]:
df

     name  maths  english  science
0  Idrees     90       89       78
1    Amri     85       86       89
2     Ali     97       77       98
3     Abu     89       88       91

In [30]:
df.english

0    89
1    86
2    77
3    88
Name: english, dtype: int64

In [32]:
ali = df['name'][2]
english_Ali = df['english'][2]
print(f'In English {ali} had {english_Ali} marks')

In English Ali had 77 marks

In [ ]:
# core data types we use in pandas?

# dataframe
# series

### create a series of data pd.series 5 values of temperature
### datafame city and temperature - cities

In [33]:
city_temp = {'city':['Kuala Lumpur','Mumbai','Sydney','Tokyo','London'],
             'temperature':['31°C','32°C','22°C','16°C','11°C']}

print(city_temp)

{'city': ['Kuala Lumpur', 'Mumbai', 'Sydney', 'Tokyo', 'London'], 'temperature': ['31°C', '32°C', '22°C', '16°C', '11°C']}

In [35]:
ctdf = pd.DataFrame(city_temp)

ctdf

           city temperature
0  Kuala Lumpur        31°C
1        Mumbai        32°C
2        Sydney        22°C
3         Tokyo        16°C
4        London        11°C

In [36]:
ctdf2 = ctdf

ctdf2['city_temp'] = city_temp

ctdf2

           city temperature city_temp
0  Kuala Lumpur        31°C       NaN
1        Mumbai        32°C       NaN
2        Sydney        22°C       NaN
3         Tokyo        16°C       NaN
4        London        11°C       NaN

In [41]:
temp11 = pd.Series([31,32,22,16,11])
print('Type of temp11: ',type(temp11))

temperatures = {
    'cities':['KL','MB','SDY','TKY','LDN'],
    'temp10':[31,32,22,16,11]
}

temp_df=pd.DataFrame(temperatures)
print('type of temp_df: ',type(temp_df))

print(temp_df)
print(temp11)

Type of temp11:  <class 'pandas.core.series.Series'>
type of temp_df:  <class 'pandas.core.frame.DataFrame'>
  cities  temp10
0     KL      31
1     MB      32
2    SDY      22
3    TKY      16
4    LDN      11
0    31
1    32
2    22
3    16
4    11
dtype: int64

In [44]:
temp_df['temp11']=temp11

temp_df

  cities  temp10  temp11
0     KL      31      31
1     MB      32      32
2    SDY      22      22
3    TKY      16      16
4    LDN      11      11

In [47]:
data = {
    'cities':['KL','KL','KL','TKY','LDN'],
    'temp10':[31,32,22,16,11]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      31
1     KL      32
2     KL      22
3    TKY      16
4    LDN      11

In [48]:
df['cities'].value_counts()

cities
KL     3
TKY    1
LDN    1
Name: count, dtype: int64

In [49]:
df['cities'].unique()

array(['KL', 'TKY', 'LDN'], dtype=object)

In [51]:
df2 =df['cities'].drop_duplicates()
df2

0     KL
3    TKY
4    LDN
Name: cities, dtype: object